export default {
    yutovo_caption: 'Ютово',

    'Ok': 'Ok',
    'Unknown command': 'Неизвестная команда',
    'Json error': 'Ошибка JSON',
    'No field': 'Нет поля',
    'Field error': 'Ошибка поля',
    'Solver error': 'Ошибка решателя',
    'Parser error': 'Ошибка разбора',
    'Operation error': 'Ошибочная операция',
    'Solver restarted': 'Рестарт сервера',
    'Syntax error': 'Синтаксическая ошибка',
    'Wrong arguments count': 'Неправильное количество аргументов',
    'Unknown identifier': 'Неизвестный идентификатор',
    'Expression expected': 'Ожидается выражение',
    'Division by zero': 'Деление на ноль',
    'Overflow': 'Переполнение',
    'Argument is over': 'Переполнение аргумента',
    'Units are incompatible': 'Размерности несовместимы',
    'Conversion does not fit': 'Преобразование невозможно',

    'Functions': 'Функции',
    'Variables': 'Переменные',
    'Units': 'Размерности',

    'SI': 'СИ',
    'rus': 'русская',

    'length': 'длина',
    'mass': 'масса',
    'time': 'время',
    'amount of matter': 'количество вещества',
    'electric current': 'электрический ток',
    'luminosity': 'светимость',
    'temperature': 'температура',
    'frequency': 'частота',
    'power': 'сила',
    'others': 'другие',

    'New document': 'Новый документ',
    'Upload document': 'Загрузить документ',
    'Save document': 'Сохранить документ',
    'Save document as': 'Сохранить документ как',
    'Download document': 'Скачать документ',
    'Rename document': 'Переименовать документ',
    'Delete document': 'Удалить документ',
    'Undo': 'Отменить',
    'Redo': 'Повторить',
    'Cut': 'Вырезать',
    'Copy': 'Скопировать',
    'Paste': 'Вставить',
    'Insert code': 'Вставить код',
    'Paragraph format': 'Формат параграфа',
    'Font family': 'Шрифт',
    'Font size': 'Размер шрифта',
    'Bold': 'Жирный',
    'Italic': 'Курсив',
    'Underline': 'Подчеркнутый',
    'Text color': 'Цвет текста',
    'Text background color': 'Цвет фона текста',

    'Plus': 'Плюс',
    'Minus': 'Минус',
    'Multiply': 'Умножение',
    'Division': 'Деление',
    'Power': 'Степень',
    'Square root': 'Квадратный корень',
    'Root of degree': 'Корень степени',
    'Subscript': 'Нижний регистр',
    'Fences': 'Скобки',
    'Radian': 'Радиан',
    'Degree': 'Градус',
    'Minute': 'Минута',
    'Second': 'Секунда',
    'Grad': 'Град',
    'Sum': 'Сумма',
    'Product': 'Произведение',
    'Assignment': 'Присваивание',
    'Unit': 'Размерность',
    'Equation': 'Равенство',
    'rad': 'рад',
    'grad': 'град',

    'Filter': 'Фильтр',

    'Documents': 'Документы',
    'Tasks': 'Задачи',
    'Identifiers': 'Идентификаторы',

    'Error saving the document: ': 'Ошибка сохранения документа: ',
    'Document size is more then limit': 'Размер документа больше лимита',
    'Error creating the document: ': 'Ошибка создания документа: ',
    'Max files count exceed': 'Превышено максимальное количество файлов',

    'Download PC version': 'Скачать версию для ПК',
    'Terms of use': 'Правила использования',
    'Download': 'Скачать',
    'Target OS': 'Для ОС',

    'About': 'О проекте',
    about_yutovo: 'Ютово - это мощный калькулятор для решения различных математических, физических и повседневных задач.\
        В отличии от других программ, Ютово делает вычисления так же, как вы их делаете на бумаге.\
        Это потому, что используется общепринятый математический синтакс, а не строковый.\
        Ютово - это решение для широкого круга арифметических, инженерных и других задач.',
    support: 'Поддержка',

    'This website uses cookies for normal functioning.': 'Этот сайт использует куки для нормального фукционирования.',

    terms_of_use: 'Сервис yutovo.ru и приложение для ПК не предоставляют никаких гарантий, явных или подразумеваемых, какого-либо назначения.<br/>\
        Провайдер сервиса yutovo.ru и десктопного приложения не несет никакой ответственности, финансовой или иной, за любой причиненный ущерб или убытки \
        от использования сервиса yutovo.ru или десктопного приложения, включая, помимо прочего, причинение ущерба \
        аппаратному и программному обеспечению Пользователя.<br/>\
        Документы, сохраненные в учетной записи yutovo.ru, являются личными для зарегистрированных пользователей.<br/>\
        Провайдер сервиса yutovo.ru оставляет за собой право использовать все загруженные документы, логи программы, результаты расчетов,\
        и входные данные внутри сервиса yutovo.ru, в целях поддержки, развития и тестирования сервиса yutovo.ru.<br/>\
        Провайдер сервиса yutovo.ru оставляет за собой право изменять настоящие Условия использования в любое время.'
};
