export default {
    yutovo_caption: 'Ютово',
    Yutovo: 'Ютово',

    'Yutovo - visual online calculator': 'Ютово - наглядный онлайн калькулятор',

    'Ok': 'Ok',
    'Unknown command': 'Неизвестная команда',
    'Json error': 'Ошибка JSON',
    'No field': 'Нет поля',
    'Field error': 'Ошибка поля',
    'Solver error': 'Ошибка решателя',
    'Parser error': 'Ошибка разбора',
    'Operation error': 'Ошибочная операция',
    'Solver restarted': 'Рестарт сервера',
    'Syntax error': 'Синтаксическая ошибка',
    'Wrong arguments count': 'Неправильное количество аргументов',
    'Unknown identifier': 'Неизвестный идентификатор',
    'Expression expected': 'Ожидается выражение',
    'Division by zero': 'Деление на ноль',
    'Overflow': 'Переполнение',
    'Argument is over': 'Переполнение аргумента',
    'Units are incompatible': 'Размерности несовместимы',
    'Conversion does not fit': 'Преобразование невозможно',
    'Solving time exceeded': 'Превышено время вычисления',

    'Functions': 'Функции',
    'Variables': 'Переменные',

    'length': 'длина',
    'mass': 'масса',
    'time': 'время',
    'amount of matter': 'количество вещества',
    'electric current': 'электрический ток',
    'luminosity': 'светимость',
    'temperature': 'температура',
    'frequency': 'частота',
    'square': 'площадь',
    'volume': 'объём',
    'force': 'сила',
    'energy': 'энергия',
    'pressure': 'давление',
    'power': 'мощность',
    'luminous flux': 'световой поток',
    'illuminance': 'освещенность',
    'electrical charge': 'электрический заряд',
    'electrical potential': 'электрическое напряжение',
    'electrical resistance': 'электрическое сопротивление',
    'electrical capacity': 'электрическая ёмкость',
    'magnetic field': 'магнитное поле',
    'magnetic flux': 'магнитный поток',
    'electrical inductance': 'электрическая индуктивность',
    'electrical conductance': 'электрическая проводимость',
    'ionizing radiation': 'ионизирующее излучение',
    'others': 'другие',
    'rest': 'остальные',
    'information': 'информация',

    'New document': 'Новый документ',
    'Upload document': 'Загрузить документ',
    'Save document': 'Сохранить документ',
    'Save document as': 'Сохранить документ как',
    'Download document': 'Скачать документ',
    'Rename document': 'Переименовать документ',
    'Delete document': 'Удалить документ',
    'Undo': 'Отменить',
    'Redo': 'Повторить',
    'Cut': 'Вырезать',
    'Copy': 'Скопировать',
    'Paste': 'Вставить',
    'Insert calculator': 'Вставить калькулятор',
    'Recalculate the document': 'Пересчитать документ',
    'Paragraph format': 'Формат параграфа',
    'Font family': 'Шрифт',
    'Font size': 'Размер шрифта',
    'Bold': 'Жирный',
    'Italic': 'Курсив',
    'Underline': 'Подчеркнутый',
    'Strikethrough': 'Зачеркнутый',
    'Text color': 'Цвет текста',
    'Text background color': 'Цвет фона текста',
    'Link': 'Ссылка',

    'Present as': 'Представить как',
    'Auto': 'Автоподбор',
    'Real': 'Вещественные',
    'Integer': 'Целые',
    'Rational': 'Дробные',
    'Complex': 'Комплексные',

    'Precision': 'Точность',
    'Exponent order': 'Порядок экспоненты',
    'Notation': 'Система счисления',

    'Binary': 'Двоичная',
    'Octal': 'Восьмеричная',
    'Decimal': 'Десятичная',
    'Hexadecimal': 'Шестнадцатиричная',

    'Fraction form': 'Тип дроби',
    'Proper': 'Правильная',
    'Improper': 'Неправильная',

    'Complex form': 'Комплексная форма',
    'Arithmetic': 'Арифметическая',
    'Trigonometric': 'Тригонометрическая',
    'Exponential': 'Экспоненциальная',

    'Plus': 'Плюс',
    'Minus': 'Минус',
    'Multiply': 'Умножение',
    'Division': 'Деление',
    'Power': 'Степень',
    'Square root': 'Квадратный корень',
    'Root of degree': 'Корень степени',
    'Subscript': 'Нижный индекс',
    'Superscript': 'Верхний индекс',
    'Fences': 'Скобки',
    'Radian': 'Радиан',
    'Degree': 'Градус',
    'Minute': 'Минута',
    'Second': 'Секунда',
    'Grad': 'Град',
    'Sum': 'Сумма',
    'Product': 'Произведение',
    'Assignment': 'Присваивание',
    'Unit': 'Размерность',
    'Equation': 'Равенство',
    'rad': 'рад',
    'grad': 'град',
    'Greek letters': 'Греческие буквы',

    'Filter': 'Фильтр',

    'Documents': 'Документы',
    'Library': 'Библиотека',
    'Identifiers': 'Идентификаторы',

    'Confirm': 'Подтвержедение',
    'Error saving the document: ': 'Ошибка сохранения документа: ',
    'Document size is more then limit': 'Размер документа больше лимита',
    'Error creating the document: ': 'Ошибка создания документа: ',
    'Max files count exceed': 'Превышено максимальное количество файлов',
    'Delete the document?': 'Удалить документ?',

    'Download PC version': 'Скачать версию для ПК',
    'Terms of use': 'Правила использования',
    'Privacy policy': 'Политика конфеденциальности',
    'Download': 'Скачать',
    'Target OS': 'Для ОС',
    'Close': 'Закрыть',

    'Login': 'Логин',
    'Logout': 'Выход',
    'user name': 'имя пользователя',
    'password': 'пароль',
    'Type the symbols above:': 'Введите символы сверху',
    'Cancel': 'Отмена',

    'Registration': 'Регистрация',
    'login': 'логин',
    'email': 'почта',
    'repeate password': 'повторите пароль',
    'Register': 'Регистрация',

    'Settings': 'Настройки',

    'User account': 'Учетная запись пользователя',
    'Name': 'Имя',
    'e-mail': 'Почта',
    'Password': 'Пароль',
    'Change name': 'Сменить имя',
    'Change e-mail': 'Сменить почту',
    'Change password': 'Сменить пароль',
    'old password': 'старый пароль',
    'new password': 'новый пароль',

    'Page not found': 'Страница не найдена',

    'Document settings': 'Настройки документа',
    'Result': 'Результат',
    'Locale': 'Язык',
    'Language': 'Язык',
    'Include documents' : 'Подключенные документы',
    'Exponential threshold': 'Порядок экспоненты',
    'Default angle measure': 'Мера угла по умолчанию',
    'Result angle measure': 'Мера угла результата',
    'Default notation': 'Система счисления по умолчанию',
    'Result notation': 'Система счисления результата',
    'Show result numeral system': 'Показывать систему счисления результата',
    'Show angle measure': 'Показывать меру угла',
    'Maximum count of results': 'Максимальное количество результатов',
    'File name': 'Имя файла',
    'Add...': 'Добавить...',

    'Units': 'Размерности',
    'SI': 'СИ',
    'Russian': 'Русская',
    'English': 'Английская',
    'Others': 'Другие',

    'First page': 'Первая страница',

    'Register code': 'Код регистрации',
    'Send code' : 'Выслать код',
    register_email_message: 'Запрос регистрации пользователя с сайта yutovo.ru. Введите этот код: EMAIL_CODE в диалоге регистрации.',

    'Password change code': 'Код смены пароля',
    'Enter code from the e-mail': 'Введите код из письма',
    password_email_message: 'Запрос смены пароля с сайта yutovo.ru. Введите этот код: EMAIL_CODE в диалоге.',

    'Login failed': 'Ошибка входа',
    'Sending registration code failed': 'Отправка регистрационного кода не удалась',
    'Getting captcha failed': 'Получение капчи не удалось',
    'Passwords are not identical': 'Пароли не идентичны',
    'The field must be filled': 'Поле должно быть заполнено',
    'Enter a correct e-mail': 'Введите правильный адрес электронной почты',
    'Login or e-mail already exists': 'Логин или адрес электронной почты уже существует',
    'Fields must not be empty': 'Поля не должны быть пустыми',
    'Wrong captcha': 'Неправильная капча',
    'Wrong register code': 'Неправильный код регистрации',
    'Wrong json in the request': 'Неправильный json в запросе',
    'Json not found in the request': 'Json не найден в запросе',
    'User not found': 'Пользователь не найден',
    'Login not found': 'Логин не найден',
    'Submit failed': 'Операция неудачна',
    'Login or password are incorrect': 'Логин или пароль неправильны',
    'Login or email are incorrect': 'Логин или почта неправильны',
    'Error getting settings': 'Ошибка получения настроек',

    'name': 'имя',

    'new e-mail': 'новая почта',

    'Text' : 'Текст',
    'Url': 'Адрес',

    'Colors' : 'Цвета',
    'Calculator block frame': 'Рамка блока калькулятора',
    'Numbers': 'Числа',
    'Shapes': 'Графические элементы',
    'Error marks': 'Отметки ошибок',
    'Formula background': 'Фон формул',
    'Background selection': 'Фон выделения',

    email_email_message: 'Запрос смены почты с сайта yutovo.ru. Введите этот код: EMAIL_CODE в диалоге.',

    'Password recovery code': 'Код восстановления пароля',
    'Recover password': 'Восстановление пароля',
    'login or e-mail': 'логин или почта',
    recover_password_email_message: 'Запрос восстановления пароля с сайта yutovo.ru. Введите этот код: EMAIL_CODE в диалоге.',

    'About': 'О проекте',
    about_yutovo: 'Ютово - это мощный калькулятор для решения различных математических, физических и повседневных задач.\
        В отличии от других программ, Ютово делает вычисления так же, как вы их делаете на бумаге.\
        Это потому, что используется общепринятый математический синтакс, а не строковый.\
        Ютово - это решение для широкого круга арифметических, инженерных и других задач.<br/><br/>\
        Использованные технологии и библиотеки: C++, WebAssembly, Emscripten, boost, MPFR, GMP, Drogon, JavaScript, Quasar, jwt-cpp, spdlog, rapidjson.<br/><br/>',
    support: 'Поддержка: e-mail: <a href="mailto:support{\'@\'}yutovo.ru">support{\'@\'}yutovo.ru</a>, \
        Телеграм: <a class="q-pa-none" target="_blank" rel="noopener noreferrer" href="https://t.me/yutovo">{\'@\'}yutovo</a>.',

    cookies_use: 'Этот сайт использует куки для нормального фукционирования.',

    terms_of_use: 'Сервис yutovo.ru, yutovo.com (далее - yutovo) и приложение для ПК не предоставляют никаких гарантий, явных или подразумеваемых, \
        какого-либо назначения.<br/>\
        Провайдер сервиса yutovo и десктопного приложения не несет никакой ответственности, финансовой или иной, за любой причиненный ущерб или убытки \
        от использования сервиса yutovo или десктопного приложения, включая, помимо прочего, причинение ущерба \
        аппаратному и программному обеспечению Пользователя.<br/>\
        Документы, сохраненные в учетной записи yutovo, являются личными для зарегистрированных пользователей.<br/>\
        Провайдер сервиса yutovo оставляет за собой право использовать все загруженные документы, логи программы, результаты расчетов,\
        и входные данные внутри сервиса yutovo, в целях поддержки, развития и тестирования сервиса yutovo.<br/>\
        Провайдер сервиса yutovo оставляет за собой право изменять настоящие Условия использования в любое время.',

    privacy_policy: 
        '1. Информация для сбора<br/>\
        Мы можем собирать личную информацию пользователя, такую как имя, адрес электронной почты, IP-адрес и другую информацию.<br/>\
        2. Способы сбора информации<br/>\
        Мы можем собирать информацию, когда пользователь регистрируется, отменяет регистрацию, входит или выходит из системы на сайте.<br/>\
        Мы можем собирать личную информацию, когда пользователь использует любую из услуг сайта.<br/>\
        3. Использование информации<br/>\
        Мы можем использовать информацию для проверки вашей учетной записи на веб-сайте, отправив письмо с подтверждением \
        на ваш зарегистрированный адрес электронной почты.<br/>\
        Мы можем использовать личную информацию для ответа на запросы пользователей.\
        Мы можем использовать личную информацию для улучшения услуг, веб-сайта и настольного приложения.\
        Мы можем использовать личную информацию в целях безопасности для защиты пользователей и веб-сайта. \
        Мы можем использовать информацию, если это разрешено законом.<br/>\
        4. Права пользователя на свои данные<br/>\
        Вы можете потребовать, чтобы мы удалили любые личные данные, которые мы храним о вас. Сюда не входят данные, \
        которые мы обязаны хранить в административных, юридических целях или целях безопасности. \
        Отправить запрос на удаление данных можно по почте: <a href="mailto:support{\'@\'}yutovo.ru">support{\'@\'}yutovo.ru</a>.<br/>\
        5. Отказ от ответственности<br/>\
        Вы принимаете на себя всю ответственность и риск в отношении использования вами веб-сайта, который предоставляется «как есть» без каких-либо гарантий.\
        Информация, доступ к которой осуществляется с помощью веб-сайта, включая, помимо прочего, весь контент и материалы, \
        а также функции и услуги, представленные на нашем веб-сайте, все они представляются без каких-либо гарантий, включая, помимо прочего, \
        гарантии относительно доступности, точности, полноты или полезности контента или информации, бесперебойности доступа и любые гарантии прав собственности, \
        ненарушения прав, коммерческой пригодности или пригодности для определенной цели. Мы не гарантируем, что наш веб-сайт или его функционирование, \
        а также содержимое и материалы предоставляемых через него услуг будут своевременными, безопасными, бесперебойными и не содержать ошибок, \
        что дефекты будут исправлены или что наши веб-сайты или серверы, обеспечивающие доступ к нашему веб-сайту, не содержат вирусов \
        или другие вредные компоненты. Вы используете наш веб-сайт на свой страх и риск, и вы принимаете на себя полную ответственность за любые расходы, связанные с \
        использование вами веб-сайта. Мы не несем ответственности за любой ущерб, связанный с использованием нашего веб-сайта.'
};
