export default {
    yutovo_caption: 'Ютово',
    Yutovo: 'Ютово',

    'Ok': 'Ok',
    'Unknown command': 'Неизвестная команда',
    'Json error': 'Ошибка JSON',
    'No field': 'Нет поля',
    'Field error': 'Ошибка поля',
    'Solver error': 'Ошибка решателя',
    'Parser error': 'Ошибка разбора',
    'Operation error': 'Ошибочная операция',
    'Solver restarted': 'Рестарт сервера',
    'Syntax error': 'Синтаксическая ошибка',
    'Wrong arguments count': 'Неправильное количество аргументов',
    'Unknown identifier': 'Неизвестный идентификатор',
    'Expression expected': 'Ожидается выражение',
    'Division by zero': 'Деление на ноль',
    'Overflow': 'Переполнение',
    'Argument is over': 'Переполнение аргумента',
    'Units are incompatible': 'Размерности несовместимы',
    'Conversion does not fit': 'Преобразование невозможно',
    'Solving time exceeded': 'Превышено время вычисления',

    'Functions': 'Функции',
    'Variables': 'Переменные',
    'Units': 'Размерности',

    'SI': 'СИ',
    'rus': 'русская',

    'length': 'длина',
    'mass': 'масса',
    'time': 'время',
    'amount of matter': 'количество вещества',
    'electric current': 'электрический ток',
    'luminosity': 'светимость',
    'temperature': 'температура',
    'frequency': 'частота',
    'power': 'сила',
    'others': 'другие',

    'New document': 'Новый документ',
    'Upload document': 'Загрузить документ',
    'Save document': 'Сохранить документ',
    'Save document as': 'Сохранить документ как',
    'Download document': 'Скачать документ',
    'Rename document': 'Переименовать документ',
    'Delete document': 'Удалить документ',
    'Undo': 'Отменить',
    'Redo': 'Повторить',
    'Cut': 'Вырезать',
    'Copy': 'Скопировать',
    'Paste': 'Вставить',
    'Insert code': 'Вставить код',
    'Recalculate the document': 'Пересчитать документ',
    'Paragraph format': 'Формат параграфа',
    'Font family': 'Шрифт',
    'Font size': 'Размер шрифта',
    'Bold': 'Жирный',
    'Italic': 'Курсив',
    'Underline': 'Подчеркнутый',
    'Text color': 'Цвет текста',
    'Text background color': 'Цвет фона текста',

    'Plus': 'Плюс',
    'Minus': 'Минус',
    'Multiply': 'Умножение',
    'Division': 'Деление',
    'Power': 'Степень',
    'Square root': 'Квадратный корень',
    'Root of degree': 'Корень степени',
    'Subscript': 'Нижний регистр',
    'Fences': 'Скобки',
    'Radian': 'Радиан',
    'Degree': 'Градус',
    'Minute': 'Минута',
    'Second': 'Секунда',
    'Grad': 'Град',
    'Sum': 'Сумма',
    'Product': 'Произведение',
    'Assignment': 'Присваивание',
    'Unit': 'Размерность',
    'Equation': 'Равенство',
    'rad': 'рад',
    'grad': 'град',
    'Greek letters': 'Греческие буквы',

    'Filter': 'Фильтр',

    'Documents': 'Документы',
    'Tasks': 'Задачи',
    'Identifiers': 'Идентификаторы',

    'Confirm': 'Подтвержедение',
    'Error saving the document: ': 'Ошибка сохранения документа: ',
    'Document size is more then limit': 'Размер документа больше лимита',
    'Error creating the document: ': 'Ошибка создания документа: ',
    'Max files count exceed': 'Превышено максимальное количество файлов',
    'Delete the document?': 'Удалить документ?',

    'Download PC version': 'Скачать версию для ПК',
    'Terms of use': 'Правила использования',
    'Privacy policy': 'Политика конфеденциальности',
    'Download': 'Скачать',
    'Target OS': 'Для ОС',

    'Login': 'Логин',
    'Logout': 'Выход',
    'user name': 'имя пользователя',
    'password': 'пароль',
    'Type the symbols above:': 'Введите символы сверху',
    'Cancel': 'Отмена',

    'Registration': 'Регистрация',
    'login': 'логин',
    'email': 'почта',
    'repeate password': 'повторите пароль',
    'Register': 'Регистрация',

    'Settings': 'Настройки',

    'About': 'О проекте',
    about_yutovo: 'Ютово - это мощный калькулятор для решения различных математических, физических и повседневных задач.\
        В отличии от других программ, Ютово делает вычисления так же, как вы их делаете на бумаге.\
        Это потому, что используется общепринятый математический синтакс, а не строковый.\
        Ютово - это решение для широкого круга арифметических, инженерных и других задач.',
    support: 'Поддержка',

    'This website uses cookies for normal functioning.': 'Этот сайт использует куки для нормального фукционирования.',

    terms_of_use: 'Сервис yutovo.ru и приложение для ПК не предоставляют никаких гарантий, явных или подразумеваемых, какого-либо назначения.<br/>\
        Провайдер сервиса yutovo.ru и десктопного приложения не несет никакой ответственности, финансовой или иной, за любой причиненный ущерб или убытки \
        от использования сервиса yutovo.ru или десктопного приложения, включая, помимо прочего, причинение ущерба \
        аппаратному и программному обеспечению Пользователя.<br/>\
        Документы, сохраненные в учетной записи yutovo.ru, являются личными для зарегистрированных пользователей.<br/>\
        Провайдер сервиса yutovo.ru оставляет за собой право использовать все загруженные документы, логи программы, результаты расчетов,\
        и входные данные внутри сервиса yutovo.ru, в целях поддержки, развития и тестирования сервиса yutovo.ru.<br/>\
        Провайдер сервиса yutovo.ru оставляет за собой право изменять настоящие Условия использования в любое время.',

    privacy_policy: 
        '1. Информация для сбора<br/>\
        Мы можем собирать личную информацию пользователя, такую как имя, адрес электронной почты, IP-адрес и другую информацию.<br/>\
        2. Способы сбора информации<br/>\
        Мы можем собирать информацию, когда пользователь регистрируется, отменяет регистрацию, входит или выходит из системы на сайте.<br/>\
        Мы можем собирать личную информацию, когда пользователь использует любую из услуг сайта.<br/>\
        3. Использование информации<br/>\
        Мы можем использовать информацию для проверки вашей учетной записи на веб-сайте, отправив письмо с подтверждением \
        на ваш зарегистрированный адрес электронной почты.<br/>\
        Мы можем использовать личную информацию для ответа на запросы пользователей.\
        Мы можем использовать личную информацию для улучшения услуг, веб-сайта и настольного приложения.\
        Мы можем использовать личную информацию в целях безопасности для защиты пользователей и веб-сайта. \
        Мы можем использовать информацию, если это разрешено законом.<br/>\
        4. Права пользователя на свои данные<br/>\
        Вы можете потребовать, чтобы мы удалили любые личные данные, которые мы храним о вас. Сюда не входят данные, \
        которые мы обязаны хранить в административных, юридических целях или целях безопасности. \
        Отправить запрос на удаление данных можно на сайте <a href="mailto:support{\'@\'}yutovo.ru">support{\'@\'}yutovo.ru</a>.<br/>\
        5. Отказ от ответственности<br/>\
        Вы принимаете на себя всю ответственность и риск в отношении использования вами веб-сайта, который предоставляется «как есть» без каких-либо гарантий.\
        Информация, доступ к которой осуществляется с помощью веб-сайта, включая, помимо прочего, весь контент и материалы, \
        а также функции и услуги, представленные на нашем веб-сайте, все они представляются без каких-либо гарантий, включая, помимо прочего, \
        гарантии относительно доступности, точности, полноты или полезности контента или информации, бесперебойности доступа и любые гарантии прав собственности, \
        ненарушения прав, коммерческой пригодности или пригодности для определенной цели. Мы не гарантируем, что наш веб-сайт или его функционирование, \
        а также содержимое и материалы предоставляемых через него услуг будут своевременными, безопасными, бесперебойными и не содержать ошибок, \
        что дефекты будут исправлены или что наши веб-сайты или серверы, обеспечивающие доступ к нашему веб-сайту, не содержат вирусов \
        или другие вредные компоненты. Вы используете наш веб-сайт на свой страх и риск, и вы принимаете на себя полную ответственность за любые расходы, связанные с \
        использование вами веб-сайта. Мы не несем ответственности за любой ущерб, связанный с использованием нашего веб-сайта.'
};
